{
    ">2 family members with dementia": "Indicates whether the patient has more than two family members diagnosed with dementia.",
    "ApoE4": "Presence of the APOE4 allele, a genetic factor that increases the risk of Alzheimer’s disease and Lewy Body Dementia. It triples the odds of developing Alzheimer’s five years earlier.",
    "ID": "Unique identifier for the patient or record.",
    "LBD_Cognitive_fluctuation": "Presence or severity of cognitive fluctuation, a core symptom of Lewy Body Dementia.",
    "LBD_Dream Enactment": "Presence or severity of dream enactment behavior, a symptom of Lewy Body Dementia.",
    "LBD_Parkisnonism": "Presence or severity of Parkinsonism, a symptom of Lewy Body Dementia.",
    "LBD_Visual_hallucinations": "Presence or severity of visual hallucinations, a symptom of Lewy Body Dementia.",
    "NDI_MEAN_LAST_10_YEARS": "Mean value of the Neurodegenerative Disease Index over the last 10 years.",
    "age at symptoms": "Age at which symptoms first appeared.",
    "age_at_visit": "Age at the time of the visit or data collection.",
    "annotations": "Additional notes or comments on the record.",
    "bad_channels": "EEG channels identified as malfunctioning or providing unreliable data.",
    "bvftd_disinhibition": "Presence or severity of disinhibition, a symptom of behavioral variant frontotemporal dementia, which may involve difficulties with language and understanding people.",
    "bvftd_early_apathy_or_inertia": "Presence or severity of early apathy or inertia, a symptom of behavioral variant frontotemporal dementia, potentially linked to language and social comprehension challenges.",
    "bvftd_early_perseverative_stereo": "Presence or severity of early perseverative or stereotyped behavior, a symptom of behavioral variant frontotemporal dementia.",
    "bvftd_hyperorality_and_dietary_c": "Presence or severity of hyperorality and dietary changes, a symptom of behavioral variant frontotemporal dementia.",
    "bvftd_loss_of_sympathy_or_empath": "Presence or severity of loss of sympathy or empathy, a symptom of behavioral variant frontotemporal dementia, related to understanding people.",
    "cdr_sum_of_boxes": "Sum of boxes score from the Clinical Dementia Rating scale, indicating the severity of dementia.",
    "comments_on_drug1": "Comments or notes about the first drug the patient is taking.",
    "csv_file_name": "Name of the CSV file containing the data.",
    "distress_agitation": "Caregiver distress caused by the patient’s agitation, assessed via the NPI-Q.",
    "distress_anxiety": "Caregiver distress caused by the patient’s anxiety, assessed via the NPI-Q.",
    "distress_apathy": "Caregiver distress caused by the patient’s apathy, assessed via the NPI-Q.",
    "distress_apetite": "Caregiver distress caused by the patient’s appetite changes, assessed via the NPI-Q.",
    "distress_delusions": "Caregiver distress caused by the patient’s delusions, assessed via the NPI-Q.",
    "distress_depression": "Caregiver distress caused by the patient’s depression, assessed via the NPI-Q.",
    "distress_disinhibition": "Caregiver distress caused by the patient’s disinhibition, assessed via the NPI-Q.",
    "distress_euphoria": "Caregiver distress caused by the patient’s euphoria, assessed via the NPI-Q.",
    "distress_halucinations": "Caregiver distress caused by the patient’s hallucinations, assessed via the NPI-Q.",
    "distress_lability": "Caregiver distress caused by the patient’s emotional lability, assessed via the NPI-Q.",
    "distress_motor": "Caregiver distress caused by the patient’s motor disturbances, assessed via the NPI-Q.",
    "distress_night": "Caregiver distress caused by the patient’s nighttime behaviors, assessed via the NPI-Q.",
    "dose_drug1": "Dosage of the first drug the patient is taking.",
    "education_by_diploma": "Level of education, categorized by the highest diploma obtained.",
    "file_name": "Name of the data file, possibly the EEG recording file.",
    "file_path": "File path to the data file.",
    "handedness": "Dominant hand of the patient (e.g., left, right, ambidextrous).",
    "lang_quest_npi": "Language in which the NPI questionnaire was administered.",
    "mmse": "Score from the Mini-Mental State Examination, a test for cognitive impairment.",
    "moca": "Score from the Montreal Cognitive Assessment, a test for cognitive impairment.",
    "name_drug_1": "Name of the first drug the patient is taking.",
    "npi_complete": "Indicates whether the NPI questionnaire was fully completed.",
    "npiq_agitation_pnr_": "Presence of agitation as reported in the Neuropsychiatric Inventory Questionnaire (NPI-Q).",
    "npiq_agitation_sev_pnr_": "Severity of agitation as reported in the NPI-Q, indicating how hard it is.",
    "npiq_anx_pnr_": "Presence of anxiety as reported in the NPI-Q.",
    "npiq_anx_sev_pnr_": "Severity of anxiety as reported in the NPI-Q, indicating how hard it is.",
    "npiq_apathy_pnr_": "Presence of apathy as reported in the NPI-Q.",
    "npiq_apathy_sev_pnr_": "Severity of apathy as reported in the NPI-Q, indicating how hard it is.",
    "npiq_delusion_pnr_": "Presence of delusions as reported in the NPI-Q.",
    "npiq_delusion_sev_pnr_": "Severity of delusions as reported in the NPI-Q, indicating how hard it is.",
    "npiq_depression_pnr_": "Presence of depression as reported in the NPI-Q.",
    "npiq_depression_sev_pnr_": "Severity of depression as reported in the NPI-Q, indicating how hard it is.",
    "npiq_disinhib_pnr_": "Presence of disinhibition as reported in the NPI-Q.",
    "npiq_disinhib_sev_pnr_": "Severity of disinhibition as reported in the NPI-Q, indicating how hard it is.",
    "npiq_eat_pnr_": "Presence of appetite/eating changes as reported in the NPI-Q.",
    "npiq_eat_sev_pnr_": "Severity of appetite/eating changes as reported in the NPI-Q, indicating how hard it is.",
    "npiq_euph_pnr_": "Presence of euphoria as reported in the NPI-Q.",
    "npiq_euph_sev_pnr_": "Severity of euphoria as reported in the NPI-Q, indicating how hard it is.",
    "npiq_hallucinate_pnr_": "Presence of hallucinations as reported in the NPI-Q.",
    "npiq_hallucinate_sev_pnr_": "Severity of hallucinations as reported in the NPI-Q, indicating how hard it is.",
    "npiq_irrit_pnr_": "Presence of irritability as reported in the NPI-Q.",
    "npiq_irrit_sev_pnr_": "Severity of irritability as reported in the NPI-Q, indicating how hard it is.",
    "npiq_motor_pnr_": "Presence of motor disturbances as reported in the NPI-Q.",
    "npiq_motor_sev_pnr_": "Severity of motor disturbances as reported in the NPI-Q, indicating how hard it is.",
    "npiq_night_pnr_": "Presence of nighttime behaviors as reported in the NPI-Q.",
    "npiq_night_sev_pnr_": "Severity of nighttime behaviors as reported in the NPI-Q, indicating how hard it is.",
    "npiq_sev_total": "Total severity score from the NPI-Q, summing the severity of all neuropsychiatric symptoms.",
    "other_lang_npi": "Other language used for the NPI questionnaire, if not the primary language.",
    "redcap_repeat_instance": "Instance number for repeated measures in the REDCap data collection system.",
    "redcap_repeat_instrument": "Instrument used for repeated measures in the REDCap system.",
    "route_drug1": "Route of administration for the first drug (e.g., oral, intravenous).",
    "sex, 1=male": "Sex of the patient, where 1 indicates male.",
    "signal_labels": "Labels of the EEG channels used in the recording.",
    "start_date": "Start date of the study or data collection.",
    "start_year_drug_1": "Year when the patient started taking the first drug.",
    "times_day_drug_1": "Number of times per day the first drug is taken.",
    "unit_of_dose_drug1": "Unit of measurement for the dose of the first drug (e.g., mg, ml).",
    "years_symptom_visit": "Number of years between the onset of symptoms and the visit.",
    "sit_read": "Likelihood of falling asleep while sitting and reading, from the Epworth Sleepiness Scale.",
    "watch_tv": "Likelihood of falling asleep while watching TV, from the Epworth Sleepiness Scale.",
    "sit_inactive_in_a_publ": "Likelihood of falling asleep while sitting inactive in a public place, from the Epworth Sleepiness Scale.",
    "car_passenger": "Likelihood of falling asleep as a passenger in a car for an hour without a break, from the Epworth Sleepiness Scale.",
    "lying_down_afternoo": "Likelihood of falling asleep while lying down to rest in the afternoon, from the Epworth Sleepiness Scale.",
    "sit_talk": "Likelihood of falling asleep while sitting and talking to someone, from the Epworth Sleepiness Scale.",
    "sit_quiet_post_lunch": "Likelihood of falling asleep while sitting quietly after lunch without alcohol, from the Epworth Sleepiness Scale.",
    "stop_traffic": "Likelihood of falling asleep while stopped for a few minutes in traffic, from the Epworth Sleepiness Scale.",
    "epworth_sum": "Total score from the Epworth Sleepiness Scale, indicating how common it is for the person to fall asleep during the day.",
    "difficulty_falling_asleep": "Severity of difficulty falling asleep, from the Insomnia Severity Index.",
    "difficulty_staying_asleep": "Severity of difficulty staying asleep, from the Insomnia Severity Index.",
    "problem_waking_up_too_earl": "Severity of waking up too early and not being able to fall back asleep, from the Insomnia Severity Index.",
    "satisfied_sleep": "Level of satisfaction with current sleep pattern, from the Insomnia Severity Index.",
    "how_noticeable_to_others_d": "How noticeable the sleep problem is to others in terms of impairing quality of life, from the Insomnia Severity Index.",
    "worried_sleep_problem": "Level of worry or distress about the current sleep problem, from the Insomnia Severity Index.",
    "sleep_interfere": "Extent to which the sleep problem interferes with daily functioning, from the Insomnia Severity Index.",
    "isi_sum": "Total score from the Insomnia Severity Index, with higher scores indicating more severe insomnia.",
    "ecog_objects_pnr_pre": "Difficulty remembering where objects are, from the Everyday Cognition (ECog) questionnaire.",
    "ecog_date_pnr_pre": "Difficulty remembering the date, from the Everyday Cognition (ECog) questionnaire.",
    "ecog_com_pnr_pre": "Difficulty understanding conversations, from the Everyday Cognition (ECog) questionnaire.",
    "ecog_instruct_pnr_pre": "Difficulty following instructions, from the Everyday Cognition (ECog) questionnaire.",
    "ecog_map_pnr_pre": "Difficulty finding one’s way around familiar places, from the Everyday Cognition (ECog) questionnaire.",
    "ecog_indoors_pnr_pre": "Difficulty navigating indoors, from the Everyday Cognition (ECog) questionnaire.",
    "ecog_weather_pnr_pre": "Difficulty understanding weather reports, from the Everyday Cognition (ECog) questionnaire.",
    "ecog_think_pnr_pre": "Difficulty thinking clearly, from the Everyday Cognition (ECog) questionnaire.",
    "ecog_organize_pnr_pre": "Difficulty organizing activities, from the Everyday Cognition (ECog) questionnaire.",
    "ecog_finance_pnr_pre": "Difficulty managing finances, from the Everyday Cognition (ECog) questionnaire.",
    "ecog_two_pnr_pre": "Difficulty doing two things at once, from the Everyday Cognition (ECog) questionnaire.",
    "ecog_multi_pnr_pre": "Difficulty multitasking, from the Everyday Cognition (ECog) questionnaire.",
    "ecog_12_sum": "Sum of the 12 items from the Everyday Cognition (ECog) questionnaire, assessing everyday cognitive function.",
    "mena": "Unknown metric or possible typo; may require clarification.",
    "core lbd syptoms (0-4)": "Number of core Lewy Body Dementia symptoms present, ranging from 0 to 4.",
    "supporting lbd symp (0-13)": "Number of supporting Lewy Body Dementia symptoms present, ranging from 0 to 13.",
    "symp bvftd (0-5)": "Number of behavioral variant frontotemporal dementia symptoms present, ranging from 0 to 5.",
    "Sheet4_sum": "Sum from another sheet or questionnaire, possibly aggregating symptom scores or other metrics.",
    "duration_sec": "Duration of the EEG recording in seconds.",
    "duration_min": "Duration of the EEG recording in minutes.",
    "number_of_signals": "Number of EEG channels or signals recorded.",
    "sampling_frequency": "Sampling frequency of the EEG data in Hertz (Hz).",
    "highpass": "High-pass filter setting used in the EEG recording.",
    "lowpass": "Low-pass filter setting used in the EEG recording.",
    "n_samples": "Number of samples in the EEG recording.",
    "size": "Size of the EEG data file.",
    "patient_number": "Unique identifier for the patient."
  }